/*
-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
Южный Федеральный Университет                                                            
Институт Компьютерных Технологий и Информационной Безопасности                           
Кафедра МОП ЭВМ                                                                          
Программирование и Основы Теории Алгоритмов                                              
Лабораторная работа 5.1 - Текстовые и бинарные файлы                     
Задача D. Письма Ильича.                                                       
Степичев Олег Геннадиевич (КТбо1-8)                                                      
01.12.2023                                                                               
-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
*/

#include <stdio.h>
#include <stdlib.h>

#define length 200

int main(void) {
    FILE *file = fopen("input.txt", "r");

    if (file == NULL) {
        fclose(file);
        exit(1);
    }

    int count = 0;
    char string_il[length];

    while(fgets(string_il, length, file) != NULL) {
        if (string_il[0] == '\n') {
            count++;
        }
    }

    fclose(file);

    printf("%d", count);
    return 0;
}

